#+title: Introduction to Machine Learning with Python Tutorial
#+author: Nick Martin
#+email: nmartin84@gmail.com
#+created: [2021-01-21 21:47]
#+source: http://noracook.io/Books/Python/introductiontomachinelearningwithpython.pdf

*** Meet your data

#+begin_src jupyter-python :session py :results output graphics :exports both :file
from sklearn.datasets import load_iris
iris_dataset = load_iris()

print("Keys from IRIS Dataset: \n{}".format(iris_dataset.keys()))
#+end_src

#+RESULTS:
: Keys from IRIS Dataset:
: dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename'])

